// Підключаємо технологію express для back-end сервера
const express = require('express')
// Cтворюємо роутер - місце, куди ми підключаємо ендпоїнти
const router = express.Router()

// ================================================================

// router.get Створює нам один ентпоїнт

// ↙️ тут вводимо шлях (PATH) до сторінки
router.get('/', function (req, res) {
  // res.render генерує нам HTML сторінку
  const data = [
    {
      isAtention: true,
      isNew: true,
      date: '25.01.23',
      text: 'До біса планувальник, наймаємо дизайнера і готуємося до презентації, як Джобс',
    },
    {
      isAtention: false,
      isNew: true,
      date: '25.01.23',
      text: 'Ми хотіли щоб у цьому чаті було близько 150 людей щоб зробити якісний пак самопрезентацій.',
    },
  ]
  // ↙️ cюди вводимо назву файлу з сontainer
  res.render('blog', {
    // вказуємо назву контейнера
    name: 'blog',
    // вказуємо назву компонентів
    // component: [],

    // вказуємо назву сторінки
    title: 'My blog',
    // ... сюди можна далі продовжувати додавати потрібні технічні дані, які будуть використовуватися в layout

    // вказуємо дані,
    // data: data,
  })
  // ↑↑ сюди вводимо JSON дані
})

// Підключаємо роутер до бек-енду
module.exports = router
